# SetProfile Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Truss..::..SetProfile Method
Truss Class See Also
---
Add or modify the profile of a truss.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetProfile(
	CurveArray topChords,
	CurveArray bottomChords
)
```

Visual Basic
---
```text
Public Sub SetProfile ( _
	topChords As CurveArray, _
	bottomChords As CurveArray _
)
```

Visual C++
---
```text
public:
void SetProfile(
	CurveArray^ topChords,
	CurveArray^ bottomChords
)
```

# ### Parameters
topChords
    Type: Autodesk.Revit.DB..::..CurveArrayThe curves serving as top chords of the truss.
bottomChords
    Type: Autodesk.Revit.DB..::..CurveArrayThe curves serving as bottom chords of the truss.
# See Also
Truss Class
Autodesk.Revit.DB.Structure Namespace